[
    {
        "q": "What is a Database?",
        "a": "A structured collection of data that allows people to extract information."
    },
    {
        "q": "Give two advantages of using a database.",
        "a": "1. Data consistency (changes only need to be made once). 2. Reduced data duplication. 3. Easier to search and filter data."
    },
    {
        "q": "What is a Single-Table Database?",
        "a": "A database that contains only one table."
    },
    {
        "q": "What is a Record in a database?",
        "a": "A row in a table that contains data about a single item, person, or event."
    },
    {
        "q": "What is a Field in a database?",
        "a": "A column in a table that contains a specific piece of information (e.g., FirstName)."
    },
    {
        "q": "What is a Primary Key?",
        "a": "A field that uniquely identifies each record in a table (e.g., ID number)."
    },
    {
        "q": "Why are Primary Keys important?",
        "a": "They ensure that each record is unique and can be easily identified."
    },
    {
        "q": "What data type would you use for a person's name?",
        "a": "Text (or Alphanumeric)."
    },
    {
        "q": "What data type would you use for a 'Yes/No' field?",
        "a": "Boolean."
    },
    {
        "q": "What data type would you use for a price?",
        "a": "Real (or Currency/Decimal)."
    },
    {
        "q": "What data type would you use for a quantity of items?",
        "a": "Integer."
    },
    {
        "q": "What data type is best for storing a Date of Birth?",
        "a": "Date/Time."
    },
    {
        "q": "What is SQL?",
        "a": "Structured Query Language - a language used to communicate with databases."
    },
    {
        "q": "What does the SQL command SELECT do?",
        "a": "It specifies which fields (columns) to retrieve from the database."
    },
    {
        "q": "What does the SQL command FROM do?",
        "a": "It specifies which table to retrieve data from."
    },
    {
        "q": "What does the SQL command WHERE do?",
        "a": "It filters the records based on a specific condition."
    },
    {
        "q": "What does the SQL command ORDER BY do?",
        "a": "It sorts the results in ascending or descending order."
    },
    {
        "q": "How do you sort in descending order in SQL?",
        "a": "Use 'ORDER BY FieldName DESC'."
    },
    {
        "q": "What does the SQL function SUM() do?",
        "a": "Calculates the total sum of a numeric column."
    },
    {
        "q": "What does the SQL function COUNT() do?",
        "a": "Counts the number of records that match a criteria."
    },
    {
        "q": "What does the SQL operator LIKE do?",
        "a": "It searches for a specified pattern in a column (e.g., WHERE Name LIKE 'S%')."
    },
    {
        "q": "What does the SQL operator BETWEEN do?",
        "a": "It selects values within a given range (e.g., WHERE Age BETWEEN 18 AND 30)."
    },
    {
        "q": "How do you write 'Not Equal To' in SQL?",
        "a": "<> or !=."
    },
    {
        "q": "Write an SQL query to select all fields from the table 'Students'.",
        "a": "SELECT * FROM Students;"
    },
    {
        "q": "Write an SQL query to find students named 'John'.",
        "a": "SELECT * FROM Students WHERE FirstName = 'John';"
    },
    {
        "q": "What is Validation in a database?",
        "a": "Checking that data entered follows certain rules (e.g., is a date, is within a range)."
    },
    {
        "q": "Give an example of a validation check for a 'Age' field.",
        "a": "Range check: Age must be between 0 and 120."
    }
]