[
    {
        "q": "I am a worldwide collection of interconnected networks. What am I?",
        "a": "The Internet."
    },
    {
        "q": "I am a collection of web pages accessed via the Internet using a browser. What am I?",
        "a": "The World Wide Web (WWW)."
    },
    {
        "q": "What does URL stand for?",
        "a": "Uniform Resource Locator."
    },
    {
        "q": "What is the function of a DNS Server?",
        "a": "It translates human-readable URLs (like www.google.com) into IP addresses (like 142.250.187.206) that computers understand."
    },
    {
        "q": "What is the difference between HTTP and HTTPS?",
        "a": "HTTPS is Secure (encrypted using SSL/TLS), while HTTP is not."
    },
    {
        "q": "I am a software application used to access and display web pages. What am I?",
        "a": "A Web Browser."
    },
    {
        "q": "I am a small text file stored on your computer by a website to remember your preferences. What am I?",
        "a": "A Cookie."
    },
    {
        "q": "What is the difference between a Session Cookie and a Persistent Cookie?",
        "a": "Session cookies are temporary (deleted when browser closes). Persistent cookies remain on your hard drive until they expire or are deleted."
    },
    {
        "q": "What is the difference between Fiat Currency and Cryptocurrency?",
        "a": "Fiat currency (e.g., Dollars, Pounds) is backed by governments/banks. Cryptocurrency is decentralised and not controlled by any central authority."
    },
    {
        "q": "I am a digital currency that uses a decentralised network. What am I?",
        "a": "Cryptocurrency (e.g., Bitcoin)."
    },
    {
        "q": "What technology underpins cryptocurrencies to ensure security and prevent tampering?",
        "a": "Blockchain."
    },
    {
        "q": "In a Blockchain, what links one block to the next?",
        "a": "The Hash of the previous block."
    },
    {
        "q": "Why is it extremely difficult to hack a Blockchain?",
        "a": "You would have to alter the data in every block across every computer in the network simultaneously, which is practically impossible."
    },
    {
        "q": "What is a Brute Force Attack?",
        "a": "Trying every possible password combination until the correct one is found."
    },
    {
        "q": "I am a tool used to intercept data packets on a network. What am I?",
        "a": "A Packet Sniffer."
    },
    {
        "q": "What is Wardriving?",
        "a": "The act of searching for Wi-Fi wireless networks, usually from a moving vehicle, to gain unauthorised access or intercept data."
    },
    {
        "q": "I am a malicious program that replicates itself to corrupt files or cause malfunction. What am I?",
        "a": "A Virus."
    },
    {
        "q": "I am a standalone malware that replicates and spreads across networks without needing a host file. What am I?",
        "a": "A Worm."
    },
    {
        "q": "I look like legitimate software but contain malicious code. What am I?",
        "a": "A Trojan Horse."
    },
    {
        "q": "I am malware that spies on your activity and sends data to a hacker. What am I?",
        "a": "Spyware."
    },
    {
        "q": "I am malware that automatically displays unwanted advertisements. What am I?",
        "a": "Adware."
    },
    {
        "q": "I am malware that locks your files and demands payment to unlock them. What am I?",
        "a": "Ransomware."
    },
    {
        "q": "What is Phishing?",
        "a": "Sending fake emails (pretending to be a bank/company) to trick users into revealing personal info."
    },
    {
        "q": "What is Pharming?",
        "a": "Redirecting a user to a fake website (often by poisoning the DNS cache) to steal data."
    },
    {
        "q": "What is a Denial of Service (DoS) attack?",
        "a": "Flooding a server with useless traffic to make it crash or become unavailable to legitimate users."
    },
    {
        "q": "What is Social Engineering?",
        "a": "Manipulating people into breaking security procedures (e.g., tricking them into giving up a password)."
    },
    {
        "q": "I sit between your computer and the internet to filter traffic and block threats. What am I?",
        "a": "A Firewall."
    },
    {
        "q": "What is Two-Step Verification (2FA)?",
        "a": "Requiring two forms of identification to log in (e.g., a password AND a code sent to your phone)."
    },
    {
        "q": "What is a Proxy Server?",
        "a": "An intermediate server that sits between a user and a website, improving privacy and performance (caching)."
    },
    {
        "q": "What does SSL stand for?",
        "a": "Secure Sockets Layer."
    },
    {
        "q": "How can you tell if a website is using SSL?",
        "a": "Look for the padlock icon and 'https://' in the address bar."
    },
    {
        "q": "What is Biometric Authentication?",
        "a": "Using unique physical characteristics (fingerprint, face ID, retina scan) to verify identity."
    }
]