[
    {
        "q": "What are Utility Programs?",
        "a": "System software performing specific maintenance tasks like virus checking, defragmentation, and backups."
    },
    {
        "q": "Define: Malware",
        "a": "Software designed to disrupt, damage, or gain unauthorized access to a computer system (viruses, worms, Trojans)."
    },
    {
        "q": "How does Anti-virus Software work?",
        "a": "It scans for, quarantines, and deletes malicious software using signature databases and heuristic checking."
    },
    {
        "q": "What is Heuristic Checking?",
        "a": "Analyzing software behavior to find *new* viruses that don't match known signatures yet."
    },
    {
        "q": "What is the purpose of Quarantine?",
        "a": "To isolate an infected file in a secure area so it cannot execute or spread before deletion."
    },
    {
        "q": "Explain the process of Defragmentation",
        "a": "Moving file blocks on a HDD so they are contiguous (next to each other) to speed up read/write access."
    },
    {
        "q": "Define: Contiguous",
        "a": "Adjoining or next to each other in sequence. Crucial for HDD efficiency."
    },
    {
        "q": "Why is Back-up software important?",
        "a": "It creates copies of data on separate media to restore files if the original is lost, corrupted, or deleted."
    },
    {
        "q": "Why do modern systems use Screensavers?",
        "a": "Originally to prevent CRT burn-in; now primarily for security (locking the screen after inactivity)."
    },
    {
        "q": "What is the role of a Device Driver?",
        "a": "It acts as a translator, converting generic OS commands into signals the specific hardware device understands."
    },
    {
        "q": "What information is in a USB Descriptor?",
        "a": "Data identifying a device (Vendor ID, Product ID) sent to the OS so it can load the correct driver."
    },
    {
        "q": "What is an Operating System?",
        "a": "System software that manages hardware resources, provides the user interface, and runs applications."
    },
    {
        "q": "What does the Bootstrap Loader do?",
        "a": "It is a small firmware program that runs at startup to load the main OS into RAM."
    },
    {
        "q": "What is EEPROM used for?",
        "a": "Electrically Erasable Programmable ROM stores firmware (like the BIOS) that can be updated/flashed."
    },
    {
        "q": "Define: HCI",
        "a": "Human Computer Interface. The boundary where the user interacts with the machine (e.g., CLI or GUI)."
    },
    {
        "q": "Compare CLI vs GUI",
        "a": "CLI: Text-based, low memory, fast for experts. GUI: Visual (WIMP), intuitive, high memory usage."
    },
    {
        "q": "What does WIMP stand for?",
        "a": "Windows, Icons, Menu, Pointer. The standard interaction model for GUIs."
    },
    {
        "q": "What is a Post-WIMP interface?",
        "a": "Touchscreen interfaces allowing complex actions like pinching, rotating, and swiping."
    },
    {
        "q": "What is Memory Management?",
        "a": "The OS function that allocates RAM to programs and ensures they don't overwrite each other's data."
    },
    {
        "q": "What is Security Management?",
        "a": "The OS function ensuring data integrity and confidentiality via user accounts, passwords, and privileges."
    },
    {
        "q": "What is Hardware Management?",
        "a": "The OS function controlling input/output devices via drivers and managing buffers/queues."
    },
    {
        "q": "What is File Management?",
        "a": "The OS function for organising storage: creating, deleting, moving, and renaming files/folders."
    },
    {
        "q": "How does Multitasking work?",
        "a": "The OS executes multiple processes seemingly at once by rapidly switching CPU time between them."
    },
    {
        "q": "What is Error Handling?",
        "a": "The OS routine that detects faults (e.g., printer jam) and prevents the system from crashing."
    },
    {
        "q": "Define: User Account",
        "a": "A profile with a username/password providing a secure, personal area for files and settings."
    },
    {
        "q": "What is an Interrupt?",
        "a": "A signal sent to the CPU to suspend the current task and handle a high-priority event."
    },
    {
        "q": "Give two examples of an Interrupt source.",
        "a": "1. Hardware (Printer out of paper). 2. User (Pressing CTRL+ALT+DEL). 3. Software (Division by zero error)."
    },
    {
        "q": "What is a Buffer?",
        "a": "A temporary memory area used to smooth out speed differences between devices (e.g., fast CPU -> slow Printer)."
    },
    {
        "q": "Define: Firmware",
        "a": "Permanent software programmed into Read-Only Memory (ROM) or EEPROM."
    },
    {
        "q": "Why do Interrupts have Priorities?",
        "a": "To ensure urgent events (Hardware Failure) are serviced before less urgent ones (Printer ready)."
    },
    {
        "q": "What is an ISR?",
        "a": "Interrupt Service Routine. The specific software code the CPU runs to handle a specific interrupt."
    },
    {
        "q": "Scenario: Why buffer video streaming?",
        "a": "The buffer fills with data so playback remains smooth even if the internet speed drops temporarily."
    },
    {
        "q": "List the steps when an Interrupt occurs",
        "a": "1. Pause Task. 2. Save Registers. 3. Run ISR. 4. Restore Registers. 5. Resume Task."
    },
    {
        "q": "What is Machine Code?",
        "a": "Binary instructions (1s and 0s) that the CPU executes directly without translation."
    },
    {
        "q": "Describe High-Level Languages",
        "a": "Code close to English (Python, Java). Easy to read/write, portable, but must be translated."
    },
    {
        "q": "Describe Low-Level Languages",
        "a": "Code close to hardware (Assembly, Machine Code). Fast, memory efficient, but hard to write/debug."
    },
    {
        "q": "What is Assembly Language?",
        "a": "Low-level code using Mnemonics (e.g., LDA, ADD) to represent binary machine code instructions."
    },
    {
        "q": "What does an Assembler do?",
        "a": "Translates Assembly Language into Machine Code."
    },
    {
        "q": "What does a Compiler do?",
        "a": "Translates ALL high-level code at once to create an executable (.exe) file. Reports errors at the end."
    },
    {
        "q": "What does an Interpreter do?",
        "a": "Translates and executes high-level code line-by-line. Stops at the first error. No .exe created."
    },
    {
        "q": "What does a Linker do?",
        "a": "It combines multiple compiled object files (modules) into a single executable program."
    },
    {
        "q": "Why choose a Compiler?",
        "a": "To protect source code (user gets .exe), for faster execution speed, and so the user doesn't need translation software."
    },
    {
        "q": "Why choose an Interpreter?",
        "a": "Better for development/debugging as it reports errors immediately on the line they occur."
    },
    {
        "q": "What is an IDE?",
        "a": "Integrated Development Environment. A software suite for coding (Editor + Translator + Debugger)."
    },
    {
        "q": "Define: Debugging",
        "a": "The process of finding and fixing errors in a computer program."
    },
    {
        "q": "What is Prettyprinting?",
        "a": "An IDE feature that colour-codes keywords and auto-indents code to make it readable."
    },
    {
        "q": "What is Auto-completion?",
        "a": "An IDE feature that predicts what you are typing (e.g., variable names) to speed up coding."
    },
    {
        "q": "What is a Report Window?",
        "a": "An IDE window showing output, variable values, or error messages during execution."
    },
    {
        "q": "Why use an IDE over a Text Editor?",
        "a": "It combines all necessary tools (writing, running, testing) in one interface, increasing efficiency."
    },
    {
        "q": "What is the difference between Bitmap and Vector Graphics software?",
        "a": "Bitmap software edits individual pixels (photos). Vector software edits lines and shapes (logos/diagrams)."
    },
    {
        "q": "What is Control and Measuring Software used for?",
        "a": "Interfacing with sensors to measure real-world data and control devices (e.g., greenhouse temperature)."
    },
    {
        "q": "What is the main purpose of Spreadsheet software?",
        "a": "Organising and manipulating numerical data using formulas and grids."
    }
]