[
    {
        "q": "What are the five stages of the Program Development Life Cycle?",
        "a": "Analysis, Design, Coding, Testing, and Maintenance."
    },
    {
        "q": "What is Decomposition?",
        "a": "Breaking down a complex problem into smaller, more manageable parts."
    },
    {
        "q": "What is Abstraction?",
        "a": "Removing unnecessary details to focus on the essential features of a problem."
    },
    {
        "q": "What is a Structure Diagram?",
        "a": "A hierarchical diagram that shows how a computer system is broken down into sub-systems."
    },
    {
        "q": "What is Top-Down Design?",
        "a": "The process of breaking a system into sub-systems, and then breaking those down further until each performs a single task."
    },
    {
        "q": "I am a diagram that shows the steps of an algorithm using shapes and arrows. What am I?",
        "a": "A Flowchart."
    },
    {
        "q": "How is a Loop represented in a flowchart?",
        "a": "By a flow line (arrow) going back to an earlier step in the process."
    },
    {
        "q": "I am a text-based way of writing algorithms that looks like code but isn't bound by syntax. What am I?",
        "a": "Pseudocode."
    },
    {
        "q": "What shape is used for 'Start' and 'Stop' in a flowchart?",
        "a": "An Oval (Terminator)."
    },
    {
        "q": "What shape is used for 'Input' and 'Output' in a flowchart?",
        "a": "A Parallelogram."
    },
    {
        "q": "What shape is used for a 'Decision' (e.g., IF statement) in a flowchart?",
        "a": "A Diamond."
    },
    {
        "q": "What shape is used for a 'Process' (e.g., calculation) in a flowchart?",
        "a": "A Rectangle."
    },
    {
        "q": "What is a Variable?",
        "a": "A named storage location in memory that holds a value which can change during execution."
    },
    {
        "q": "What is a Constant?",
        "a": "A named storage location in memory that holds a value which CANNOT change during execution."
    },
    {
        "q": "I am a loop that repeats a specific number of times. Which loop am I?",
        "a": "FOR ... TO ... NEXT loop."
    },
    {
        "q": "I am a loop that repeats UNTIL a condition is true (checked at the end). Which loop am I?",
        "a": "REPEAT ... UNTIL loop."
    },
    {
        "q": "I am a loop that repeats WHILE a condition is true (checked at the start). Which loop am I?",
        "a": "WHILE ... DO ... ENDWHILE loop."
    },
    {
        "q": "What is the difference between Verification and Validation?",
        "a": "Validation checks if data is reasonable/sensible. Verification checks if data has been copied correctly."
    },
    {
        "q": "Give two methods of Verification.",
        "a": "1. Double Entry (typing it twice). 2. Visual Check (comparing input to original source)."
    },
    {
        "q": "Give an example of a Range Check.",
        "a": "Checking if a percentage mark is between 0 and 100."
    },
    {
        "q": "Give an example of a Length Check.",
        "a": "Checking if a password is at least 8 characters long."
    },
    {
        "q": "Give an example of a Type Check.",
        "a": "Checking if the input is a number (integer) and not text."
    },
    {
        "q": "What is a Presence Check?",
        "a": "Ensuring that data has been entered and the field has not been left blank."
    },
    {
        "q": "What is a Format Check?",
        "a": "Ensuring data follows a specific pattern (e.g., DD/MM/YYYY for a date)."
    },
    {
        "q": "What is a Check Digit?",
        "a": "A digit added to the end of a number (like a barcode) to check for transmission errors."
    },
    {
        "q": "What is Normal Test Data?",
        "a": "Data that is within the expected range and should be accepted."
    },
    {
        "q": "What is Abnormal (Erroneous) Test Data?",
        "a": "Data that is invalid and should be rejected."
    },
    {
        "q": "What is Extreme Test Data?",
        "a": "Data at the limits of the valid range (e.g., 0 and 100 for a percentage)."
    },
    {
        "q": "What is Boundary Test Data?",
        "a": "Data at the limits and just outside the limits (e.g., -1, 0 and 100, 101)."
    },
    {
        "q": "What is a Trace Table used for?",
        "a": "To manually track the values of variables in an algorithm step-by-step (Dry Run) to find errors."
    },
    {
        "q": "What is a Linear Search?",
        "a": "Checking each item in a list one by one until the target is found."
    },
    {
        "q": "What is a Bubble Sort?",
        "a": "A sorting algorithm that repeatedly swaps adjacent elements if they are in the wrong order."
    },
    {
        "q": "What is Totalling?",
        "a": "Adding values to a running total variable (e.g., Total = Total + Number)."
    },
    {
        "q": "What is Counting?",
        "a": "Incrementing a variable by 1 to count occurrences (e.g., Count = Count + 1)."
    }
]