[
    {
        "q": "I am a system that uses sensors, microprocessors, and actuators to work without human intervention. What am I?",
        "a": "An Automated System."
    },
    {
        "q": "What is the role of a Sensor in an automated system?",
        "a": "To measure physical quantities (like temperature, light, pressure) and send data to the microprocessor."
    },
    {
        "q": "What is the role of a Microprocessor in an automated system?",
        "a": "To process data from sensors, compare it to stored values, and send signals to actuators."
    },
    {
        "q": "What is the role of an Actuator in an automated system?",
        "a": "To receive signals from the microprocessor and control a mechanism (e.g., turn on a motor, open a valve)."
    },
    {
        "q": "Give an example of an automated system in a car.",
        "a": "Adaptive Cruise Control, Self-Parking System, or Automatic Braking."
    },
    {
        "q": "How does Adaptive Cruise Control determine the distance to the car ahead?",
        "a": "It uses Laser or Radar sensors to bounce signals off the vehicle in front and calculates distance based on the time taken for the signal to return."
    },
    {
        "q": "I am a machine that can sense my surroundings, move, and complete tasks autonomously. What am I?",
        "a": "A Robot."
    },
    {
        "q": "What are the three main characteristics of a robot?",
        "a": "1. Ability to sense surroundings. 2. Ability to move. 3. Programmable to complete tasks."
    },
    {
        "q": "Give two advantages of using robots in manufacturing.",
        "a": "They can work 24/7 without rest, are more precise/consistent, and can work in dangerous environments."
    },
    {
        "q": "Give two disadvantages of using robots in manufacturing.",
        "a": "High initial cost to set up, and they can lead to unemployment for human workers."
    },
    {
        "q": "What is Artificial Intelligence (AI)?",
        "a": "Computer systems that can simulate human intelligence (e.g., reasoning, learning, problem-solving)."
    },
    {
        "q": "I am a type of AI that mimics the decision-making ability of a human expert. What am I?",
        "a": "An Expert System."
    },
    {
        "q": "Scenario: A doctor uses a computer program to help diagnose a rare disease. What type of AI is this?",
        "a": "An Expert System."
    },
    {
        "q": "What are the three main components of an Expert System?",
        "a": "Knowledge Base, Inference Engine, and User Interface."
    },
    {
        "q": "What is the function of the Inference Engine?",
        "a": "It applies rules to the knowledge base and user input to make decisions or predictions."
    },
    {
        "q": "What is Machine Learning?",
        "a": "A subset of AI where computers learn from data and improve their performance without being explicitly programmed for every rule."
    },
    {
        "q": "Give an example of Machine Learning in daily life.",
        "a": "Email spam filters, product recommendations (Netflix/Amazon), or voice assistants (Siri/Alexa)."
    },
    {
        "q": "What is the difference between Narrow AI and General AI?",
        "a": "Narrow AI is good at one specific task (e.g., playing chess). General AI can perform any intellectual task a human can do."
    },
    {
        "q": "I am a sensor used to detect if a door is open or closed. What am I?",
        "a": "Magnetic Field Sensor (or Proximity Sensor)."
    },
    {
        "q": "I am a sensor used to measure the acidity of a liquid. What am I?",
        "a": "pH Sensor."
    },
    {
        "q": "I am a sensor used to measure wind speed. What am I?",
        "a": "An Anemometer."
    },
    {
        "q": "I am a sensor used in game controllers to detect tilting or motion. What am I?",
        "a": "An Accelerometer."
    },
    {
        "q": "In a greenhouse, what actuator would be used if the temperature is too high?",
        "a": "A motor to open a window or a fan to cool the air."
    },
    {
        "q": "Why use automated systems in a nuclear power station?",
        "a": "To ensure safety by keeping humans away from radiation and to react faster than humans to dangerous changes."
    },
    {
        "q": "How does an automated irrigation system save water?",
        "a": "It uses soil moisture sensors to only water the crops when absolutely necessary, preventing waste."
    },
    {
        "q": "What is a Chatbot?",
        "a": "A computer program designed to simulate conversation with human users, often using AI."
    }
]