[
    {
        "q": "I am a small chunk of data sent over a network. I have a Header, Payload, and Trailer. What am I?",
        "a": "A Data Packet."
    },
    {
        "q": "What 3 key pieces of information are found in a Packet Header?",
        "a": "Sender's IP Address, Receiver's IP Address, and Packet Sequence Number."
    },
    {
        "q": "I am the part of a packet that contains the actual message or data. What am I?",
        "a": "The Payload."
    },
    {
        "q": "What is the purpose of a Packet Trailer?",
        "a": "To mark the end of the packet and contain error-checking data (like a CRC)."
    },
    {
        "q": "I am a device that directs data packets to their destination across different networks. What am I?",
        "a": "A Router."
    },
    {
        "q": "Explain Packet Switching in simple terms.",
        "a": "Breaking a message into packets, sending them independently across a network (often via different routes), and reassembling them at the end."
    },
    {
        "q": "What happens if packets arrive out of order?",
        "a": "The receiving computer uses the Sequence Number in the header to reorder them correctly."
    },
    {
        "q": "I am a transmission mode where data flows in ONE direction only (like a radio). What am I?",
        "a": "Simplex Transmission."
    },
    {
        "q": "I am a transmission mode where data flows in BOTH directions, but NOT at the same time (like a walkie-talkie). What am I?",
        "a": "Half-Duplex Transmission."
    },
    {
        "q": "I am a transmission mode where data flows in BOTH directions SIMULTANEOUSLY (like a phone call). What am I?",
        "a": "Full-Duplex Transmission."
    },
    {
        "q": "What is the difference between Serial and Parallel transmission?",
        "a": "Serial sends 1 bit at a time over 1 wire. Parallel sends multiple bits (e.g., 8) at once over multiple wires."
    },
    {
        "q": "Why is Serial transmission preferred for long distances?",
        "a": "It is cheaper (fewer wires), reliable, and avoids data skewing (bits arriving at different times)."
    },
    {
        "q": "What is Data Skewing?",
        "a": "A problem in parallel transmission where bits travel at slightly different speeds and arrive out of sync."
    },
    {
        "q": "What does USB stand for?",
        "a": "Universal Serial Bus."
    },
    {
        "q": "Give two benefits of USB.",
        "a": "1. Impossible to plug in incorrectly. 2. Automatically detected (plug and play). 3. Powers the device."
    },
    {
        "q": "What is a major advantage of the USB-C connector over older USB types?",
        "a": "It is reversible (can be plugged in either way) and supports higher power charging and faster data transfer."
    },
    {
        "q": "I am an error check that counts the number of 1s in a byte. What am I?",
        "a": "A Parity Check (Odd or Even)."
    },
    {
        "q": "If we use Even Parity, what is the parity bit for the data 1011001?",
        "a": "0 (There are already four 1s, which is even)."
    },
    {
        "q": "If we use Odd Parity, what is the parity bit for the data 1011001?",
        "a": "1 (There are four 1s, so we add a 1 to make it five, which is odd)."
    },
    {
        "q": "What is a Checksum?",
        "a": "A calculated value sent with a block of data. The receiver recalculates it; if the values match, the data is likely error-free."
    },
    {
        "q": "What does a Cyclic Redundancy Check (CRC) verify?",
        "a": "That the packet payload has not been corrupted during transmission. It uses complex math to generate a checksum."
    },
    {
        "q": "I am an error check where the receiver sends the data back to the sender for comparison. What am I?",
        "a": "An Echo Check."
    },
    {
        "q": "What is an ARQ (Automatic Repeat Request)?",
        "a": "A system where the receiver acknowledges valid data. If no acknowledgement is received within a timeout, the sender re-sends the data."
    },
    {
        "q": "What is a Check Digit?",
        "a": "A final digit added to a code (like a barcode) calculated from the other digits to detect data entry errors."
    },
    {
        "q": "Scenario: You are entering a barcode. You accidentally swap two digits. What detects this error?",
        "a": "The Check Digit calculation will fail, alerting the system that the code is invalid."
    },
    {
        "q": "What is Encryption?",
        "a": "Scrambling data into a meaningless format so it cannot be understood if intercepted."
    },
    {
        "q": "What is the difference between Plaintext and Ciphertext?",
        "a": "Plaintext is the original message. Ciphertext is the scrambled (encrypted) message."
    },
    {
        "q": "I use the SAME key to encrypt and decrypt. What type of encryption am I?",
        "a": "Symmetric Encryption."
    },
    {
        "q": "I use a Public Key to encrypt and a Private Key to decrypt. What type of encryption am I?",
        "a": "Asymmetric Encryption."
    },
    {
        "q": "In Asymmetric Encryption, which key do you share with everyone?",
        "a": "The Public Key."
    },
    {
        "q": "In Asymmetric Encryption, which key must you keep secret?",
        "a": "The Private Key."
    },
    {
        "q": "Why is Asymmetric Encryption more secure for the internet?",
        "a": "You don't need to send the secret decryption key over the network, so it can't be intercepted."
    },
    {
        "q": "Scenario: You are streaming a live football match using Packet Switching. The video freezes. Why?",
        "a": "Packets may be arriving out of order or taking different routes, causing a delay while the buffer waits to reassemble them."
    },
    {
        "q": "What is a Hacker?",
        "a": "A person who tries to gain unauthorised access to a computer system."
    },
    {
        "q": "What is Malware?",
        "a": "Malicious software (viruses, worms, spyware) designed to harm a computer system."
    },
    {
        "q": "What is a Firewall?",
        "a": "Software or hardware that monitors and controls incoming and outgoing network traffic based on security rules."
    }
]