[
    {
        "q": "I am a number system that uses only 0 and 1. What am I?",
        "a": "The Binary Number System (Base 2)."
    },
    {
        "q": "Why do computers use binary?",
        "a": "Because they are made of billions of tiny switches (transistors) that can only be in two states: ON (1) or OFF (0)."
    },
    {
        "q": "I am a unit of data consisting of 8 bits. What am I?",
        "a": "A Byte."
    },
    {
        "q": "I am a unit of data consisting of 4 bits (half a byte). What am I?",
        "a": "A Nibble."
    },
    {
        "q": "I am a number system with 16 distinct digits (0-9 and A-F). What am I?",
        "a": "The Hexadecimal Number System (Base 16)."
    },
    {
        "q": "Why do programmers prefer Hexadecimal over Binary?",
        "a": "It is shorter and easier for humans to read/write/debug. One hex digit represents exactly 4 binary bits."
    },
    {
        "q": "Convert the Hex digit 'A' to Denary.",
        "a": "10"
    },
    {
        "q": "Convert the Hex digit 'F' to Denary.",
        "a": "15"
    },
    {
        "q": "What is a MAC Address?",
        "a": "Media Access Control address. A unique hexadecimal number assigned to a Network Interface Card (NIC) to identify a device."
    },
    {
        "q": "I look like '00-1C-B3-4F-25-FE'. What am I?",
        "a": "A MAC Address. The first half identifies the manufacturer, the second half is the serial number."
    },
    {
        "q": "What is the difference between IPv4 and IPv6?",
        "a": "IPv4 uses 32-bit addresses (e.g., 192.168.1.1). IPv6 uses 128-bit addresses (hexadecimal) to accommodate more devices."
    },
    {
        "q": "In HTML colour codes, what does #FF0000 represent?",
        "a": "Pure Red. (Red=FF, Green=00, Blue=00)."
    },
    {
        "q": "What happens if you add two 8-bit numbers and the result is 9 bits?",
        "a": "An Overflow Error occurs. The extra bit is lost or causes an error."
    },
    {
        "q": "True or False: A logical left shift ALWAYS doubles the number perfectly.",
        "a": "False. If the most significant bit is 1, it is shifted out, causing an overflow error and an incorrect value."
    },
    {
        "q": "If I shift the binary number 0000 0101 one place to the LEFT, what happens to its value?",
        "a": "It doubles (becomes 10, or 0000 1010)."
    },
    {
        "q": "If I shift a binary number to the RIGHT, what mathematical operation am I performing?",
        "a": "Division by 2 (for each shift)."
    },
    {
        "q": "What is Two's Complement used for?",
        "a": "To represent negative numbers in binary. The Most Significant Bit (MSB) becomes negative (e.g., -128)."
    },
    {
        "q": "In 8-bit Two's Complement, what is the value of 1000 0000?",
        "a": "-128"
    },
    {
        "q": "How do you represent -5 in 8-bit Two's Complement?",
        "a": "1111 1011. (Start with +5: 0000 0101, Flip bits: 1111 1010, Add 1: 1111 1011)."
    },
    {
        "q": "What is a Character Set?",
        "a": "A defined list of characters recognised by computer hardware and software (e.g., ASCII, Unicode)."
    },
    {
        "q": "Why is Unicode superior to ASCII?",
        "a": "ASCII uses only 7/8 bits (English only). Unicode uses up to 32 bits, covering all world languages and emojis."
    },
    {
        "q": "How is sound digitised?",
        "a": "The amplitude of the sound wave is sampled at regular intervals. Each sample is converted to a binary value."
    },
    {
        "q": "What is Sampling Rate?",
        "a": "The number of sound samples taken per second (measured in Hertz)."
    },
    {
        "q": "What is Sampling Resolution (Bit Depth)?",
        "a": "The number of bits used to store each sound sample. Higher depth = better quality but larger file size."
    },
    {
        "q": "How do you calculate the file size of a sound clip?",
        "a": "Sample Rate x Sampling Resolution x Duration (in seconds)."
    },
    {
        "q": "I am the smallest element of a digital image. What am I?",
        "a": "A Pixel (Picture Element)."
    },
    {
        "q": "What is Image Resolution?",
        "a": "The number of pixels in an image (Width x Height)."
    },
    {
        "q": "What is Colour Depth?",
        "a": "The number of bits used to represent the colour of each pixel. (e.g., 8-bit = 256 colours)."
    },
    {
        "q": "How do you calculate the file size of an image?",
        "a": "Resolution (Width x Height) x Colour Depth."
    },
    {
        "q": "What is the difference between KiB and kB?",
        "a": "kB (kilobyte) is 1000 bytes. KiB (kibibyte) is 1024 bytes (2^10)."
    },
    {
        "q": "I reduce file size by permanently removing data. What kind of compression am I?",
        "a": "Lossy Compression (e.g., JPEG, MP3)."
    },
    {
        "q": "I reduce file size without losing any original data. What kind of compression am I?",
        "a": "Lossless Compression (e.g., ZIP, RLE)."
    },
    {
        "q": "How does Run Length Encoding (RLE) work?",
        "a": "It replaces repeating sequences of data with a single value and a count (e.g., 'AAAAA' becomes '5A')."
    },
    {
        "q": "Why would you use Lossy compression for streaming video?",
        "a": "To significantly reduce file size and bandwidth usage, allowing smooth playback even if quality drops slightly."
    },
    {
        "q": "What is a Bitmap Image?",
        "a": "An image made up of a grid of pixels, where each pixel has a specific colour value."
    },
    {
        "q": "What is an Error Code?",
        "a": "A hexadecimal number generated by the computer to identify the location or type of a problem."
    },
    {
        "q": "Define: Bandwidth",
        "a": "The maximum rate of data transfer across a network."
    },
    {
        "q": "What is the effect of increasing Sampling Rate on a sound file?",
        "a": "The sound quality improves (closer to original wave), but the file size increases."
    },
    {
        "q": "What happens when you zoom into a low-resolution bitmap?",
        "a": "It becomes pixelated (you can see the individual square pixels)."
    },
    {
        "q": "Scenario: You are emailing a text document. Which compression method should you use?",
        "a": "Lossless (e.g., ZIP). You cannot lose any text data, or the document will be unreadable."
    },
    {
        "q": "Scenario: You want to store a high-quality photo for a billboard. High Resolution or High Colour Depth?",
        "a": "High Resolution. You need a lot of pixels so it doesn't look blocky when printed huge."
    },
    {
        "q": "Scenario: A 1-minute recording is 10MB. You double the sampling rate. What is the new size?",
        "a": "20MB. Doubling the rate doubles the number of samples."
    }
]