[
    {
        "q": "What is a Logic Gate?",
        "a": "A building block of digital circuits that takes binary inputs and produces a binary output based on a rule."
    },
    {
        "q": "What are the two possible values in Boolean logic?",
        "a": "True (1) and False (0)."
    },
    {
        "q": "I am a logic gate that reverses the input. If input is 1, output is 0. What am I?",
        "a": "NOT gate."
    },
    {
        "q": "Which logic gate symbol is a triangle with a small circle at the tip?",
        "a": "NOT gate."
    },
    {
        "q": "I am a logic gate that outputs 1 ONLY if both inputs are 1. What am I?",
        "a": "AND gate."
    },
    {
        "q": "Which logic gate symbol is shaped like the letter 'D'?",
        "a": "AND gate."
    },
    {
        "q": "I am a logic gate that outputs 1 if at least one input is 1. What am I?",
        "a": "OR gate."
    },
    {
        "q": "Which logic gate symbol has a curved back and comes to a point (like a shield)?",
        "a": "OR gate."
    },
    {
        "q": "I am a logic gate that outputs 0 ONLY if both inputs are 1. (Opposite of AND). What am I?",
        "a": "NAND gate."
    },
    {
        "q": "I am a logic gate that outputs 1 ONLY if both inputs are 0. (Opposite of OR). What am I?",
        "a": "NOR gate."
    },
    {
        "q": "I am a logic gate that outputs 1 if the inputs are DIFFERENT (one is 1, the other is 0). What am I?",
        "a": "XOR gate (Exclusive OR)."
    },
    {
        "q": "What is a Truth Table?",
        "a": "A table that lists all possible input combinations and the corresponding output for a logic gate or circuit."
    },
    {
        "q": "How many rows does a truth table have for a circuit with 2 inputs?",
        "a": "4 rows (2^2)."
    },
    {
        "q": "How many rows does a truth table have for a circuit with 3 inputs?",
        "a": "8 rows (2^3)."
    },
    {
        "q": "What is a Logic Circuit?",
        "a": "A combination of multiple logic gates connected together to perform a complex function."
    },
    {
        "q": "What is a Logic Expression?",
        "a": "A mathematical way to write a logic circuit (e.g., X = A AND B)."
    },
    {
        "q": "Write the logic expression for an AND gate with inputs A and B.",
        "a": "X = A AND B (or X = A . B)."
    },
    {
        "q": "Write the logic expression for an OR gate with inputs A and B.",
        "a": "X = A OR B (or X = A + B)."
    },
    {
        "q": "Write the logic expression for a NOT gate with input A.",
        "a": "X = NOT A (or X = Ā)."
    },
    {
        "q": "Scenario: A security light turns on (L=1) if it is Dark (D=1) AND Motion is detected (M=1). Write the logic expression.",
        "a": "L = D AND M."
    },
    {
        "q": "Scenario: An alarm sounds (A=1) if a Window is open (W=1) OR the Door is open (D=1). Write the logic expression.",
        "a": "A = W OR D."
    },
    {
        "q": "If A=1 and B=0, what is the output of A AND B?",
        "a": "0 (False)."
    },
    {
        "q": "If A=1 and B=0, what is the output of A OR B?",
        "a": "1 (True)."
    },
    {
        "q": "If A=1 and B=0, what is the output of A XOR B?",
        "a": "1 (True)."
    },
    {
        "q": "If A=1 and B=1, what is the output of A NAND B?",
        "a": "0 (False)."
    }
]