[
    {
        "q": "I am the 'brain' of the computer, responsible for processing instructions. What am I?",
        "a": "The Central Processing Unit (CPU)."
    },
    {
        "q": "What are the three main components of the CPU?",
        "a": "Control Unit (CU), Arithmetic Logic Unit (ALU), and Registers."
    },
    {
        "q": "I am the architecture where data and programs are stored in the same memory. What am I?",
        "a": "Von Neumann Architecture."
    },
    {
        "q": "What does the ALU do?",
        "a": "Performs Arithmetic (maths) and Logical (AND, OR, NOT) operations."
    },
    {
        "q": "What is the function of the Control Unit (CU)?",
        "a": "It manages the flow of data and instructions, and coordinates the other parts of the CPU."
    },
    {
        "q": "I hold the address of the NEXT instruction to be fetched. Which register am I?",
        "a": "Program Counter (PC)."
    },
    {
        "q": "I hold the current instruction being executed. Which register am I?",
        "a": "Current Instruction Register (CIR)."
    },
    {
        "q": "I am a register that stores the results of calculations from the ALU. What am I?",
        "a": "The Accumulator (ACC)."
    },
    {
        "q": "What is the purpose of the Memory Address Register (MAR)?",
        "a": "To hold the address of the memory location currently being read from or written to."
    },
    {
        "q": "What is the purpose of the Memory Data Register (MDR)?",
        "a": "To hold the data or instruction that has just been fetched from memory or is about to be written to it."
    },
    {
        "q": "Describe the Fetch-Decode-Execute cycle.",
        "a": "1. Fetch instruction from memory. 2. Decode the instruction to understand it. 3. Execute the instruction."
    },
    {
        "q": "I am a bus that carries data between the CPU and memory. I am bidirectional. What am I?",
        "a": "The Data Bus."
    },
    {
        "q": "I am a bus that carries memory addresses from the CPU to memory. I am unidirectional. What am I?",
        "a": "The Address Bus."
    },
    {
        "q": "I am a bus that carries command signals from the CU to other components. What am I?",
        "a": "The Control Bus."
    },
    {
        "q": "What is the function of the System Clock?",
        "a": "It generates timing signals to synchronise all operations within the computer."
    },
    {
        "q": "What is an Embedded System?",
        "a": "A computer system built into a larger device, designed to perform a specific function (e.g., washing machine controller)."
    },
    {
        "q": "Give two benefits of Embedded Systems.",
        "a": "1. Low power consumption. 2. Small size. 3. Low cost. 4. Reliable for specific tasks."
    },
    {
        "q": "What is the difference between RAM and ROM?",
        "a": "RAM is Volatile (loses data when power is off) and Read/Write. ROM is Non-Volatile and Read-Only."
    },
    {
        "q": "Why does a computer need Cache memory?",
        "a": "It is faster than RAM and stores frequently used data/instructions close to the CPU to speed up processing."
    },
    {
        "q": "I am a type of storage that uses magnetic platters. What am I?",
        "a": "Hard Disk Drive (HDD)."
    },
    {
        "q": "I am a type of storage with no moving parts, using flash memory. What am I?",
        "a": "Solid State Drive (SSD)."
    },
    {
        "q": "Give two advantages of SSDs over HDDs.",
        "a": "Faster access speed, more durable (no moving parts), quieter, consumes less power."
    },
    {
        "q": "What is Virtual Memory?",
        "a": "Using a section of the Hard Drive (secondary storage) as an extension of RAM when RAM is full."
    },
    {
        "q": "What is the main disadvantage of using Virtual Memory?",
        "a": "It is much slower than real RAM, leading to 'disk thrashing' and reduced performance."
    },
    {
        "q": "I am an input device that reads black and white lines. What am I?",
        "a": "A Barcode Scanner."
    },
    {
        "q": "I am an input device that captures physical 3D objects into a digital model. What am I?",
        "a": "A 3D Scanner."
    },
    {
        "q": "How does a Resistive Touch Screen work?",
        "a": "Two layers touch when pressed, completing a circuit. It is cheaper but doesn't support multi-touch."
    },
    {
        "q": "How does a Capacitive Touch Screen work?",
        "a": "It uses the electrical charge of the human body to detect touch. It supports multi-touch and is more durable."
    },
    {
        "q": "I am an output device that creates physical objects layer by layer. What am I?",
        "a": "A 3D Printer."
    },
    {
        "q": "Scenario: You need to print high-quality photographs. Which printer do you choose?",
        "a": "Inkjet Printer."
    },
    {
        "q": "Scenario: You need to print 1,000 text documents quickly. Which printer do you choose?",
        "a": "Laser Printer."
    },
    {
        "q": "What is the difference between LCD and OLED screens?",
        "a": "LCD requires a backlight. OLED pixels emit their own light, allowing for thinner screens and deeper blacks."
    },
    {
        "q": "I am a sensor that detects movement. What am I?",
        "a": "Motion Sensor (or Infrared Sensor)."
    },
    {
        "q": "Scenario: A street light turns on automatically when it gets dark. What sensor is used?",
        "a": "Light Sensor."
    },
    {
        "q": "I am a sensor used in a greenhouse to control windows. What might I measure?",
        "a": "Temperature or Humidity."
    },
    {
        "q": "What is an Actuator?",
        "a": "A mechanical component (like a motor) that moves or controls a mechanism or system, often controlled by a computer."
    },
    {
        "q": "What is a MAC Address?",
        "a": "A unique hardware address assigned to a Network Interface Card (NIC) by the manufacturer."
    },
    {
        "q": "What is the difference between Static and Dynamic IP addresses?",
        "a": "Static IP never changes (good for servers). Dynamic IP is assigned temporarily by a DHCP server when you connect."
    }
]